curvedDuctFlowPiso/opt/openfoam240/tutorials/heatTransfer/buoyantBoussinesqPimpleFoam/hotRoom/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    floor
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    ceiling
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    fixedWalls
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
}

// ************************************************************************* //
